  /*1.数组的创建于元素赋值*/
  //杨辉三角(二维数组)、回形数(二维数组)、6个数,1-30之间随机生成且不重复。
  /*2针对于数值型的数组*/
  //最大值、最小值、总和、平均数等
  /*3.数组的赋值与复制*/
  //int[] array1,array2;
  //array1 =new int[]{1,2,3,4};
public class cn_32 {
    public static  void  main(String[] args){
      /*Java面向对象学习的三条主线:(第4-6章)
      * 1.Java类及类的成员:属性、方法、构造器、代码块、内部类
      * 2.面向对象的三大特征:封装性,继承性,多态性,(抽象性)
      * 3.其它关键字:this,super,static,final,abstract,interface,package,import
      * 大处着眼,小处着手
      *
      * “人把大象装进冰箱”
      * 面向过程:强调的是功能行为,以函数为最小单位,考虑怎么做
      * ①把冰箱门打开
      * ②抬起大象,塞进冰箱
      * ③把冰箱关闭
      *
      * 2.面向对象:强调具备了功能的对象,以类/对象为最小单位,考虑谁来做
      *
      * 人{
      *      打开(冰箱){
      *           冰箱.开开();
      *      }
      *       抬起(大象){
      *           大象.进入(冰箱);
      *      }
      *      关闭(冰箱){
      *            冰箱.闭合();
      *      }
      * }
      *
      *
      * 冰箱{
      *       开开(){}
      *       闭合(){}
      * }
      *
      * 大象{
      *        进入(冰箱){
      *          }
      * }
      *
      * 三:面向对象的两个要素:
      * 类:对一类事物的描述,是抽象、概念上定义
      * 对象:是实际存在的该事物的每个个体,因而也称之为实例(instance)
      * >面向对象程序设计重点是类的设计
      * >设计类,就是设计类的成员
      * */



    }
}
